; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 67)
	(= (value c1) 29)
	(= (value c2) 91)
	(= (value c3) 97)
	(= (value c4) 6)
	(= (value c5) 12)
	(= (value c6) 94)
	(= (value c7) 6)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 7
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 7
3. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 7
4. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 7
5. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 7
6. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 7
7. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 4 of 7
8. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 4 of 7
9. (increment c1)
   changed: (value c1) from 29 to 37
   goals met: 4 of 7
10. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 7
11. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 7
12. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 4 of 7
13. (increment c1)
   changed: (value c1) from 37 to 46
   goals met: 4 of 7
14. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 4 of 7
15. (increment c1)
   changed: (value c1) from 46 to 56
   goals met: 4 of 7
16. (increment c1)
   changed: (value c1) from 56 to 66
   goals met: 4 of 7
17. (increment c1)
   changed: (value c1) from 66 to 76
   goals met: 5 of 7
18. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 5 of 7
19. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 5 of 7
20. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 5 of 7
21. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 5 of 7
22. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 5 of 7
23. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 5 of 7
24. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 5 of 7
25. (increment c7)
   changed: (value c7) from 6 to 13
   goals met: 5 of 7
26. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 5 of 7
27. (increment c7)
   changed: (value c7) from 13 to 21
   goals met: 5 of 7
28. (increment c7)
   changed: (value c7) from 21 to 29
   goals met: 5 of 7
29. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 5 of 7
30. (increment c7)
   changed: (value c7) from 29 to 38
   goals met: 5 of 7
31. (increment c7)
   changed: (value c7) from 38 to 47
   goals met: 5 of 7
32. (increment c7)
   changed: (value c7) from 47 to 56
   goals met: 5 of 7
33. (increment c7)
   changed: (value c7) from 56 to 65
   goals met: 5 of 7
34. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 5 of 7
35. (increment c7)
   changed: (value c7) from 65 to 75
   goals met: 5 of 7
36. (increment c7)
   changed: (value c7) from 75 to 85
   goals met: 5 of 7
37. (increment c7)
   changed: (value c7) from 85 to 95
   goals met: 6 of 7
38. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 7
39. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 7
40. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 7
41. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 7
42. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 7
43. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 6 of 7
44. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 7
45. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 6 of 7
46. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 6 of 7
47. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 6 of 7
48. (increment c4)
   changed: (value c4) from 6 to 16
   goals met: 5 of 7
49. (increment c4)
   changed: (value c4) from 16 to 26
   goals met: 5 of 7
50. (increment c4)
   changed: (value c4) from 26 to 36
   goals met: 5 of 7
51. (increment c4)
   changed: (value c4) from 36 to 46
   goals met: 5 of 7
52. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 5 of 7
53. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 5 of 7
54. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 5 of 7
55. (increment c4)
   changed: (value c4) from 46 to 56
   goals met: 5 of 7
56. (increment c4)
   changed: (value c4) from 56 to 66
   goals met: 5 of 7
57. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 7
58. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 7
59. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 5 of 7
60. (increment c4)
   changed: (value c4) from 66 to 76
   goals met: 5 of 7
61. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 7
62. (decrement c4)
   changed: (value c4) from 76 to 66
   goals met: 5 of 7
63. (decrement c4)
   changed: (value c4) from 66 to 56
   goals met: 5 of 7
64. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 5 of 7
65. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 5 of 7
66. (increment c5)
   changed: (value c5) from 12 to 18
   goals met: 5 of 7
67. (increment c5)
   changed: (value c5) from 18 to 24
   goals met: 5 of 7
68. (increment c5)
   changed: (value c5) from 24 to 30
   goals met: 5 of 7
69. (increment c5)
   changed: (value c5) from 30 to 36
   goals met: 5 of 7
70. (increment c5)
   changed: (value c5) from 36 to 42
   goals met: 5 of 7
71. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 7
72. (increment c4)
   changed: (value c4) from 56 to 66
   goals met: 5 of 7
73. (decrement c3)
   changed: (value c3) from 97 to 93
   goals met: 5 of 7
74. (increment c5)
   changed: (value c5) from 42 to 48
   goals met: 5 of 7
75. (increment c5)
   changed: (value c5) from 48 to 54
   goals met: 5 of 7
76. (increment c5)
   changed: (value c5) from 54 to 60
   goals met: 5 of 7
77. (increment c5)
   changed: (value c5) from 60 to 66
   goals met: 5 of 7
78. (increment c5)
   changed: (value c5) from 66 to 72
   goals met: 6 of 7
79. (increment c4)
   changed: (value c4) from 66 to 76
   goals met: 5 of 7
80. (increment c4)
   changed: (value c4) from 76 to 86
   goals met: 5 of 7
81. (increment c5)
   changed: (value c5) from 72 to 78
   goals met: 5 of 7
82. (increment c5)
   changed: (value c5) from 78 to 84
   goals met: 5 of 7
83. (increment c5)
   changed: (value c5) from 84 to 90
   goals met: 6 of 7
84. (decrement c3)
   changed: (value c3) from 93 to 89
   goals met: 5 of 7
85. (decrement c3)
   changed: (value c3) from 89 to 85
   goals met: 6 of 7
86. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 7
87. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 6 of 7
88. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 6 of 7
89. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 7
90. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 7
91. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 7
92. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 6 of 7
93. (decrement c2)
   changed: (value c2) from 91 to 87
   goals met: 6 of 7
94. (decrement c2)
   changed: (value c2) from 87 to 83
   goals met: 7 of 7
